#include<stdio.h>
//嘤实在是做不出来，抱大腿
int main(){
    //三维的字符数组用起来用起来
    char ch[3][10][5],c;//记得多一个空间来放'\0',题目的意思是，不是ASCII中的字符大小也不会超过4字节，就把它当作一串字符串处理即可
    int k[5];
    int K;

    for(int i=0;i<3;i++){
        for(int j=0;(c=getchar())!='\n';){
            if(c=='[') scanf("%[^]]",ch[i][j++]);//对于scanf函数"%[^x]",就是输入到符号x为止；对于本题就是从扫描到“[”开始输入，直到“]”为止
        }
    }
    scanf("%d",&K);
    //能边处理边输出是最好的
    for(int i=0;i<K;i++){
        for(int j=0;j<5;j++){
            scanf("%d",&k[j]);
        }
        if(k[0]>=1 && k[0]<=10 && ch[0][--k[0]][0]
        && k[1]>=1 && k[1]<=10 && *ch[1][--k[1]]//取内容应该也可以换成上边的表示吧，只要第一个字符不为空
        && k[2]>=1 && k[2]<=10 && *ch[2][--k[2]]
        && k[3]>=1 && k[3]<=10 && *ch[1][--k[3]]
        && k[4]>=1 && k[4]<=10 && *ch[0][--k[4]])
            //printf打印的时候不会处理'\0'
            printf("%s(%s%s%s)%s\n",ch[0][k[0]],ch[1][k[1]],ch[2][k[2]],ch[1][k[3]],ch[0][k[4]]);//前面已经--k[j],请打印的时候就不用了
        else puts("Are you kidding me? @\\/@"); //请一定注意有歧义的符号'\'
    }

    return 0;

}
